Repository: slavast1/meamore
Catalog: packages/meamore_shared/lib/l10n/app_*.arb
Languages: he

# appTitle
source: Barbershop Admin
he: ניהול מספרה

# employeesTitle
source: Employees
he: עובדים

source: No employees yet.
he: אין עובדים עדיין.

# addEmployeeTitle
source: Add employee
he: הוסף עובד

# employeeStatusTitle
source: Employee status
he: סטטוס עובד

source: Edit
he: עריכה

source: Delete
he: מחיקה

source: Save
he: שמירה

source: Cancel
he: ביטול

source: Create
he: צור

source: Clear
he: נקה

source: Follow device
he: לפי המכשיר

source: English
he: אנגלית

source: Hebrew
he: עברית

# deleteEmployeesTitle
source: Delete employees
he: מחיקת עובדים

# deleteEmployeesConfirm
source: Delete {count} selected employee(s)?
he: למחוק {count} עובד(ים) שנבחרו?

# editEmployeeTitle
source: Edit employee
he: עריכת עובד

# firstNameLabel
source: First name
he: שם פרטי

# lastNameLabel
source: Last name
he: שם משפחה

# idNumberLabel
source: ID number
he: מספר מזהה

# phoneLabel
source: Phone
he: טלפון

# statusLabel
source: Status
he: סטטוס

# activeSessionLabel
source: Active session
he: סשן פעיל

# startedAtLabel
source: Started at
he: התחיל ב

# idNumberDigitsOnlyLabel
source: ID number (digits only)
he: מספר מזהה (ספרות בלבד)

# phoneDigitsOnlyLabel
source: Phone (digits only)
he: טלפון (ספרות בלבד)

# idCannotBeChanged
source: Cannot be changed
he: לא ניתן לשינוי

# noneValue
source: (none)
he: (אין)

# notAvailableValue
source: (n/a)
he: (לא זמין)

# noNameValue
source: (no name)
he: (ללא שם)

# noIdValue
source: (no ID)
he: (אין מזהה)

# noPhoneValue
source: (no phone)
he: (אין טלפון)

# inviteCodeText
source: Invite code: {code}
he: קוד הזמנה: {code}

# inviteCodeHelp
source: Give this code to the employee.
he: תן את הקוד לעובד.

source: Employee not found.
he: העובד לא נמצא.

# errorFirstLastRequired
source: First and last name are required.
he: חובה להזין שם פרטי ושם משפחה.

# errorIdRequired
source: ID number is required.
he: חובה להזין מספר מזהה.

# errorIdDigitsOnly
source: ID number must contain digits only.
he: מספר מזהה חייב להכיל ספרות בלבד.

# errorPhoneRequired
source: Phone is required.
he: חובה להזין טלפון.

# errorPhoneDigitsOnly
source: Phone must contain digits only.
he: טלפון חייב להכיל ספרות בלבד.

# errorInviteCodeFailed
source: Failed to generate invite code. Please try again.
he: יצירת קוד ההזמנה נכשלה. נסה שוב.

# errorWithMessage
source: Error: {message}
he: שגיאה: {message}

# statusIdle
source: Idle
he: פנוי

# statusWorking
source: Working
he: בעבודה

# statusOffline
source: Offline
he: לא מחובר

# statusUnknown
source: Unknown
he: לא ידוע

# employeeAppTitle
source: Meamore Employee
he: Meamore עובד

# employeeSetupTitle
source: Employee setup
he: הגדרת עובד

# employeeIdLabel
source: Employee ID
he: מזהה עובד

# employeeIdDigitsOnlyLabel
source: Employee ID (digits only)
he: מזהה עובד (ספרות בלבד)

# employeeIdHelp
source: Enter your employee ID to continue.
he: הזן את מזהה העובד כדי להמשיך.

# continueAction
source: Continue
he: המשך

# logoutAction
source: Sign out
he: התנתק

# changeEmployeeAction
source: Change employee
he: החלף עובד

# errorEmployeeIdRequired
source: Employee ID is required.
he: חובה להזין מזהה עובד.

# errorEmployeeIdDigitsOnly
source: Employee ID must contain digits only.
he: מזהה עובד חייב להכיל ספרות בלבד.

# errorEmployeeNotFound
source: Employee not found. Check your ID and try again.
he: העובד לא נמצא. בדוק את המזהה ונסה שוב.

# errorEmployeeLoadFailed
source: Failed to load employee. Please try again.
he: טעינת פרטי העובד נכשלה. נסה שוב.

# treatmentTitle
source: Treatment
he: טיפול

# treatmentNewTitle
source: New treatment
he: טיפול חדש

# treatmentTypeLabel
source: Treatment type
he: סוג טיפול

# dogNameLabel
source: Dog name
he: שם הכלב

# dogBreedLabel
source: Breed
he: גזע

# dogOwnerNameLabel
source: Owner name
he: שם הבעלים

# coatConditionLabel
source: Coat condition
he: מצב הפרווה

# coatConditionHelp
source: 1 = awful, 5 = perfect
he: 1 = גרוע מאוד, 5 = מושלם

# startTreatmentAction
source: Start treatment
he: התחל טיפול

# finishTreatmentAction
source: Finish treatment
he: סיים טיפול

source: Treatment in progress
he: טיפול מתבצע

source: Treatment saved.
he: הטיפול נשמר.

# errorTreatmentTypeRequired
source: Treatment type is required.
he: חובה להזין סוג טיפול.

# errorDogNameRequired
source: Dog name is required.
he: חובה להזין שם כלב.

# errorDogBreedRequired
source: Breed is required.
he: חובה להזין גזע.

# errorOwnerNameRequired
source: Owner name is required.
he: חובה להזין שם בעלים.

# errorCoatConditionRequired
source: Coat condition is required.
he: חובה לבחור מצב פרווה.

# errorCoatConditionRange
source: Coat condition must be between 1 and 5.
he: מצב הפרווה חייב להיות בין 1 ל-5.

# errorStartTreatmentFailed
source: Failed to start treatment. Please try again.
he: התחלת הטיפול נכשלה. נסה שוב.

# errorFinishTreatmentFailed
source: Failed to finish treatment. Please try again.
he: סיום הטיפול נכשל. נסה שוב.

# statusBusy
source: Busy
he: עסוק

# startedAtValue
source: Started: {time}
he: התחיל: {time}

# endedAtValue
source: Ended: {time}
he: הסתיים: {time}

# queueTitle
source: Queue
he: תור

source: No customers in queue.
he: אין לקוחות בתור.

# treatedTodayTitle
source: Finished today
he: הסתיימו היום

# reportsTitle
source: Reports
he: דוחות

# reportPeriodLabel
source: Period
he: תקופה

# reportDateLabel
source: Date
he: תאריך

# reportRangeLabel
source: Range
he: טווח

# reportAllEmployeesOption
source: All employees
he: כל העובדים

# reportGenerateAction
source: Generate report
he: הצג דוח

# reportGenerateExcelAction
source: Export to Excel
he: ייצוא לאקסל

source: Report saved.
he: הדוח נשמר.

# reportPeriodDaily
source: Daily
he: יומי

# reportPeriodWeekly
source: Weekly
he: שבועי

# reportPeriodMonthly
source: Monthly
he: חודשי

# reportPeriodQuarterly
source: Quarterly
he: רבעוני

# reportNoTreatmentsInRange
source: No treatments in selected range.
he: אין טיפולים בטווח שנבחר.

# doneByMeTitle
source: Done by me
he: בוצע על ידי

source: No busy treatments
he: אין טיפולים פעילים

# treatmentTimeColumn
source: Treatment time
he: זמן טיפול

source: No treated today
he: אין טיפולים שהסתיימו היום

source: No done by me today
he: אין טיפולים שבוצעו על ידי היום
